/* this is a command line*/

say "welcome to the Nihilzone!"
say"without space"
say somethings (makes it all bigger)
say say


X = 7
IF X = 7 THEN SAY "x = 7" /*somethings here for example*/

say = 123
say say

message = "playlist we need."
ECHO message
ECHO Hello there

Z = 11
IF Z = 10 THEN
    SAY "Z is 10"
ElSE
    SAY "Z is not 10!"

she = "ded"
ECHO she
ECHO ded


/* this is a /*comment */ inside comment */


SAY "Hi,
I'm,
Nihil"